{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.20.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_1043_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1043", "trainable": true, "batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_53", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1044", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_54", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1045", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_55", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1046", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_56", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_22", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 1028, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 8, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of65.bin", "group1-shard2of65.bin", "group1-shard3of65.bin", "group1-shard4of65.bin", "group1-shard5of65.bin", "group1-shard6of65.bin", "group1-shard7of65.bin", "group1-shard8of65.bin", "group1-shard9of65.bin", "group1-shard10of65.bin", "group1-shard11of65.bin", "group1-shard12of65.bin", "group1-shard13of65.bin", "group1-shard14of65.bin", "group1-shard15of65.bin", "group1-shard16of65.bin", "group1-shard17of65.bin", "group1-shard18of65.bin", "group1-shard19of65.bin", "group1-shard20of65.bin", "group1-shard21of65.bin", "group1-shard22of65.bin", "group1-shard23of65.bin", "group1-shard24of65.bin", "group1-shard25of65.bin", "group1-shard26of65.bin", "group1-shard27of65.bin", "group1-shard28of65.bin", "group1-shard29of65.bin", "group1-shard30of65.bin", "group1-shard31of65.bin", "group1-shard32of65.bin", "group1-shard33of65.bin", "group1-shard34of65.bin", "group1-shard35of65.bin", "group1-shard36of65.bin", "group1-shard37of65.bin", "group1-shard38of65.bin", "group1-shard39of65.bin", "group1-shard40of65.bin", "group1-shard41of65.bin", "group1-shard42of65.bin", "group1-shard43of65.bin", "group1-shard44of65.bin", "group1-shard45of65.bin", "group1-shard46of65.bin", "group1-shard47of65.bin", "group1-shard48of65.bin", "group1-shard49of65.bin", "group1-shard50of65.bin", "group1-shard51of65.bin", "group1-shard52of65.bin", "group1-shard53of65.bin", "group1-shard54of65.bin", "group1-shard55of65.bin", "group1-shard56of65.bin", "group1-shard57of65.bin", "group1-shard58of65.bin", "group1-shard59of65.bin", "group1-shard60of65.bin", "group1-shard61of65.bin", "group1-shard62of65.bin", "group1-shard63of65.bin", "group1-shard64of65.bin", "group1-shard65of65.bin"], "weights": [{"name": "conv2d_1043/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_1043/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1044/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1044/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1045/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_1045/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_1046/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_1046/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_37/kernel", "shape": [65536, 1028], "dtype": "float32"}, {"name": "dense_37/bias", "shape": [1028], "dtype": "float32"}, {"name": "dense_38/kernel", "shape": [1028, 8], "dtype": "float32"}, {"name": "dense_38/bias", "shape": [8], "dtype": "float32"}]}]}